// import htmlLogo from '../assets/images/html.png'
// import cssLogo from '../assets/images/CSS3.png'
// import jsLogo from '../assets/images/js.png'
// import rjsLogo from '../assets/images/reactjs.png'
// import reduxLogo from '../assets/images/redux.png'
import MultiCam1000 from '../assets/images/MultiCam1000.png'
import TrotecSpeedy100R from '../assets/images/TrotecSpeedy100R.png'
import MimakiJV33 from '../assets/images/MimakiJV33.png'
import MimakiUJF from '../assets/images/MimakiUJF.png'
import mimakiCG100 from '../assets/images/mimakiCG100.png'

export default () => {
    return [
        {
            key: MultiCam1000,
            image: MultiCam1000,
            title: 'Фрезерно-гравировальный станок с ЧПУ <br>MultiCam® 1000 <span>(пр-ва США)</span><p>18 тыс. оборотов в минуту, шпиндель Perske® (пр-ва Германия)</p>',
            subtitle: 'Предназначен для фрезерования, сверления, нанесения рельефного и 3D-изображения  на различных видах материала:  древесине, пластмассе, фанере и композите, ПВХ, пенопласте и т.д.'
        },
        {
            key: TrotecSpeedy100R,
            image: TrotecSpeedy100R,
            title: 'Лазерный гравер <br>Trotec® Speedy 100R <span>(пр-ва Австрия)</span><p>На базе газового СО2 лазера, 60W</p>',
            subtitle: '<span>Лазерная гравировка</span> - окрашенные металлические поверхности, пластики, резина, древесные материалы, акрил, оргстекло, стекло, кожа, ткань и др.',
            subtitle_second: '<span>Лазерная резка</span> - неметаллические листовые материалы, дерево и древесные материалы, оргстекло, пластик, бумага, картон и пр.'
        },
        {
            key: MimakiJV33,
            image: MimakiJV33,
            title: 'Широкоформатный печатающий плоттер <br>Mimaki® JV33-160 BS <span>(пр-ва Япония)</span><p>1440dpi, оригинальные сольвентные чернила Mimaki® BS3, ширина 1600 мм</p>',
            subtitle: 'Используется для печати широкоформатных высококачественных фотоизображений на самоклеющейся пленке, банере, холстах, фотообоях шириной до 1,6м, оригинальные сольвентные чернила обладают высокой устойчивостью к внешним воздействиям, от влаги и солнца'
        },
        {
            key: MimakiJV33,
            image: MimakiJV33,
            title: 'Широкоформатный печатающий плоттер-каттер <br>Mimaki® СJV150-107 VEIKA <span>(пр-ва Япония)</span><p>1440dpi, экосольвентные чернила Veila®, ширина 1070 мм</p>',
            subtitle: 'Плоттер используется для печати с последующей обрезкой по контуру изображений. Отличное решение для изготовления этикеток, наклеек и самоклеющихся постеров. Печатает на самоклеющейся пленке, фотообоях, холстах и баннере.'
        },
        {
            key: MimakiUJF,
            image: MimakiUJF,
            title: 'УФ принтер <br>Mimaki® UJF 3042HG <span>(пр-ва Япония)</span><p>Размеры поля 300*420мм, возможность печатания белыми чернилами, лаком, праймером</p>',
            subtitle: 'Печать на любых материалах - бумаге, ткани, виниле, металле, дереве, стекле, кафельной плитке - такое разнообразие открывает новые возможности для визуальной реализации самых необычных идей. Отдельной областью использования УФ-принтеров стала "сувенирная" печать - подразумевается прямое нанесение изображений на чехлы для телефонов, магниты, ручки, зажигалки и т.д.'
        },
        {
            key: mimakiCG100,
            image: mimakiCG100,
            title: 'Режущий плоттер <br>Mimaki® CG-100SRIII <span>(пр-ва Япония)</span><p>Ширина 1000мм</p>',
            subtitle: 'Незменимый помощник в изготовлении вывесок, световых коробов, стендов, табличек, аппликаций транспортных средств. Используется для резки самых различных самоклеющих пленок от металлизированных до световозвращающих.'
        }
        // {
        //   key: 1,
        //   image: htmlLogo,
        //   title: 'HTML',
        //   subtitle: 'Cтандартизированный язык разметки документов во Всемирной паутине. Большинство веб-страниц содержат описание разметки на языке HTML. Язык HTML интерпретируется браузерами; полученный в результате интерпретации форматированный текст отображается на экране монитора компьютера или мобильного устройства.'
        // },
        // {
        //   key: 2,
        //   image: cssLogo,
        //   title: 'CSS',
        //   subtitle: 'Формальный язык описания внешнего вида документа, написанного с использованием языка разметки. Преимущественно используется как средство описания, оформления внешнего вида веб-страниц, написанных с помощью языков разметки HTML и XHTML, но может также применяться к любым XML-документам, например, к SVG или XUL.'
        // },
        // {
        //   key: 3,
        //   image: jsLogo,
        //   title: 'JavaScript',
        //   subtitle: 'мультипарадигменный язык программирования. Поддерживает объектно-ориентированный, императивный и функциональный стили. Является реализацией языка ECMAScript. JavaScript обычно используется как встраиваемый язык для программного доступа к объектам приложений.'
        // },
        // {
        //   key: 4,
        //   image: rjsLogo,
        //   title: 'React',
        //   subtitle: 'JavaScript-библиотека с открытым исходным кодом для разработки пользовательских интерфейсов. React разрабатывается и поддерживается Facebook, Instagram и сообществом отдельных разработчиков и корпораций. React может использоваться для разработки одностраничных и мобильных приложений.'
        // },
        // {
        //   key: 5,
        //   image: reduxLogo,
        //   title: 'Redux',
        //   subtitle: 'Библиотека для JavaScript с открытым исходным кодом, предназначенная для управления состоянием приложения. Чаще всего используется в связке с React или Angular для разработки клиентской части. Содержит ряд инструментов, позволяющих значительно упростить передачу данных хранилища через контекст.'
        // }
    ]
}